Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.0.80/Microchip.PIC32CM-JH_DFP.pdsc
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="PIC32CM2532JH01064">
         <description>Headers and startup code for Microchip PIC32CM2532JH01064</description>
         <files>
            <file condition="C" category="include" name="PIC32CM-JH01/include/"/>
            <file condition="C"
                  category="header"
                  name="PIC32CM-JH01/include/pic32c.h"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CM-JH01/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CM-JH01/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CM-JH01/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CM-JH01/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CM-JH01/gcc/gcc/startup_pic32cm2532jh01064.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CM-JH01/gcc/system_pic32cm2532jh01064.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="PIC32CM-JH01/gcc/gcc/pic32cm2532jh01064_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="PIC32CM-JH01/gcc/gcc/pic32cm2532jh01064_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CM-JH01/armcc/armcc/startup_pic32cm2532jh01064.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CM-JH01/armcc/system_pic32cm2532jh01064.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CM-JH01/iar/iar/startup_pic32cm2532jh01064.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CM-JH01/iar/system_pic32cm2532jh01064.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="PIC32CM-JH01/iar/config/linker/Microchip/pic32cm2532jh01064/sram.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="PIC32CM-JH01/iar/config/linker/Microchip/pic32cm2532jh01064/flash.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="PIC32CM2532JH01100">
         <description>Headers and startup code for Microchip PIC32CM2532JH01100</description>
         <files>
            <file condition="C" category="include" name="PIC32CM-JH01/include/"/>
            <file condition="C"
                  category="header"
                  name="PIC32CM-JH01/include/pic32c.h"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CM-JH01/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CM-JH01/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CM-JH01/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CM-JH01/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CM-JH01/gcc/gcc/startup_pic32cm2532jh01100.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CM-JH01/gcc/system_pic32cm2532jh01100.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="PIC32CM-JH01/gcc/gcc/pic32cm2532jh01100_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="PIC32CM-JH01/gcc/gcc/pic32cm2532jh01100_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CM-JH01/armcc/armcc/startup_pic32cm2532jh01100.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CM-JH01/armcc/system_pic32cm2532jh01100.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CM-JH01/iar/iar/startup_pic32cm2532jh01100.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CM-JH01/iar/system_pic32cm2532jh01100.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="PIC32CM-JH01/iar/config/linker/Microchip/pic32cm2532jh01100/sram.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="PIC32CM-JH01/iar/config/linker/Microchip/pic32cm2532jh01100/flash.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="PIC32CM5164JH00032">
         <description>Headers and startup code for Microchip PIC32CM5164JH00032</description>
         <files>
            <file condition="C" category="include" name="PIC32CM-JH00/include/"/>
            <file condition="C"
                  category="header"
                  name="PIC32CM-JH00/include/pic32c.h"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CM-JH00/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CM-JH00/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CM-JH00/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CM-JH00/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CM-JH00/gcc/gcc/startup_pic32cm5164jh00032.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CM-JH00/gcc/system_pic32cm5164jh00032.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="PIC32CM-JH00/gcc/gcc/pic32cm5164jh00032_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="PIC32CM-JH00/gcc/gcc/pic32cm5164jh00032_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CM-JH00/armcc/armcc/startup_pic32cm5164jh00032.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CM-JH00/armcc/system_pic32cm5164jh00032.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CM-JH00/iar/iar/startup_pic32cm5164jh00032.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CM-JH00/iar/system_pic32cm5164jh00032.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="PIC32CM-JH00/iar/config/linker/Microchip/pic32cm5164jh00032/sram.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="PIC32CM-JH00/iar/config/linker/Microchip/pic32cm5164jh00032/flash.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="PIC32CM5164JH00048">
         <description>Headers and startup code for Microchip PIC32CM5164JH00048</description>
         <files>
            <file condition="C" category="include" name="PIC32CM-JH00/include/"/>
            <file condition="C"
                  category="header"
                  name="PIC32CM-JH00/include/pic32c.h"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CM-JH00/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CM-JH00/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CM-JH00/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CM-JH00/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CM-JH00/gcc/gcc/startup_pic32cm5164jh00048.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CM-JH00/gcc/system_pic32cm5164jh00048.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="PIC32CM-JH00/gcc/gcc/pic32cm5164jh00048_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="PIC32CM-JH00/gcc/gcc/pic32cm5164jh00048_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CM-JH00/armcc/armcc/startup_pic32cm5164jh00048.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CM-JH00/armcc/system_pic32cm5164jh00048.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CM-JH00/iar/iar/startup_pic32cm5164jh00048.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CM-JH00/iar/system_pic32cm5164jh00048.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="PIC32CM-JH00/iar/config/linker/Microchip/pic32cm5164jh00048/sram.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="PIC32CM-JH00/iar/config/linker/Microchip/pic32cm5164jh00048/flash.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="PIC32CM5164JH00064">
         <description>Headers and startup code for Microchip PIC32CM5164JH00064</description>
         <files>
            <file condition="C" category="include" name="PIC32CM-JH00/include/"/>
            <file condition="C"
                  category="header"
                  name="PIC32CM-JH00/include/pic32c.h"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CM-JH00/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CM-JH00/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CM-JH00/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CM-JH00/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CM-JH00/gcc/gcc/startup_pic32cm5164jh00064.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CM-JH00/gcc/system_pic32cm5164jh00064.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="PIC32CM-JH00/gcc/gcc/pic32cm5164jh00064_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="PIC32CM-JH00/gcc/gcc/pic32cm5164jh00064_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CM-JH00/armcc/armcc/startup_pic32cm5164jh00064.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CM-JH00/armcc/system_pic32cm5164jh00064.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CM-JH00/iar/iar/startup_pic32cm5164jh00064.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CM-JH00/iar/system_pic32cm5164jh00064.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="PIC32CM-JH00/iar/config/linker/Microchip/pic32cm5164jh00064/sram.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="PIC32CM-JH00/iar/config/linker/Microchip/pic32cm5164jh00064/flash.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="PIC32CM5164JH00100">
         <description>Headers and startup code for Microchip PIC32CM5164JH00100</description>
         <files>
            <file condition="C" category="include" name="PIC32CM-JH00/include/"/>
            <file condition="C"
                  category="header"
                  name="PIC32CM-JH00/include/pic32c.h"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CM-JH00/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CM-JH00/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CM-JH00/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CM-JH00/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CM-JH00/gcc/gcc/startup_pic32cm5164jh00100.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CM-JH00/gcc/system_pic32cm5164jh00100.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="PIC32CM-JH00/gcc/gcc/pic32cm5164jh00100_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="PIC32CM-JH00/gcc/gcc/pic32cm5164jh00100_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CM-JH00/armcc/armcc/startup_pic32cm5164jh00100.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CM-JH00/armcc/system_pic32cm5164jh00100.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CM-JH00/iar/iar/startup_pic32cm5164jh00100.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CM-JH00/iar/system_pic32cm5164jh00100.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="PIC32CM-JH00/iar/config/linker/Microchip/pic32cm5164jh00100/sram.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="PIC32CM-JH00/iar/config/linker/Microchip/pic32cm5164jh00100/flash.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="PIC32CM5164JH01032">
         <description>Headers and startup code for Microchip PIC32CM5164JH01032</description>
         <files>
            <file condition="C" category="include" name="PIC32CM-JH01/include/"/>
            <file condition="C"
                  category="header"
                  name="PIC32CM-JH01/include/pic32c.h"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CM-JH01/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CM-JH01/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CM-JH01/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CM-JH01/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CM-JH01/gcc/gcc/startup_pic32cm5164jh01032.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CM-JH01/gcc/system_pic32cm5164jh01032.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="PIC32CM-JH01/gcc/gcc/pic32cm5164jh01032_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="PIC32CM-JH01/gcc/gcc/pic32cm5164jh01032_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CM-JH01/armcc/armcc/startup_pic32cm5164jh01032.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CM-JH01/armcc/system_pic32cm5164jh01032.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CM-JH01/iar/iar/startup_pic32cm5164jh01032.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CM-JH01/iar/system_pic32cm5164jh01032.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="PIC32CM-JH01/iar/config/linker/Microchip/pic32cm5164jh01032/sram.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="PIC32CM-JH01/iar/config/linker/Microchip/pic32cm5164jh01032/flash.icf"
                  attr="config"/>
         </files>
      </component>
